package tackSem4;

public class Tack1 {
    public static void main(String[] args) {
       // 1) Замерьте время, за которое в ArrayList добавятся 10000 элементов.
       // 2) Замерьте время, за которое в LinkedList добавятся 10000 элементов. Сравните с предыдущим.

    }
}

    /*Реализовать консольное приложение, которое:
        Принимает от пользователя строку вида
        text:num
        Нужно сделать “сплит” строки по : , сохранить text в связный список на позицию num.
        Если введено print:num, выводит строку из позиции num в связном списке и удаляет её из списка.*//*Реализовать консольное приложение, которое:
        /*Принимает от пользователя строку вида
        text:num
        Нужно сделать “сплит” строки по : , сохранить text в связный список на позицию num.
        Если введено print:num, выводит строку из позиции num в связном списке и удаляет её из списка.*/
